Тест/Тест/src/Reports/ПланированиеРасходовНаЗарплату/ПланированиеРасходовНаЗарплату.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ПланированиеРасходовНаЗарплату</name>
</mdclass:Report>

Тест/Тест/src/Documents/Расходы/Расходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Расходы</name>
  <basedOn>Document.МаршрутныйЛист</basedOn>
  <basedOn>Document.ПоступлениеЗапчастей</basedOn>
  <basedOn>Document.ЗаказНаряд</basedOn>
  <basedOn>Document.ЛистыУщерба</basedOn>
  <basedOn>Document.ПродажаЗапчастей</basedOn>
  <basedOn>Document.ЗаявкаНаРасход</basedOn>
  <registerRecords>AccumulationRegister.РасчетыСПоставщиками</registerRecords>
  <registerRecords>AccumulationRegister.ОплатыПоСделкам</registerRecords>
  <registerRecords>AccumulationRegister.ТопливоВБаках</registerRecords>
  <registerRecords>AccumulationRegister.СебестоимостьПеревозок</registerRecords>
  <registerRecords>AccumulationRegister.Баланс</registerRecords>
  <registerRecords>AccumulationRegister.Расходы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРасхода</name>
    <type>
      <types>CatalogRef.ВидыРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодтверждающийДокумент</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Откуда</name>
    <type>
      <types>DocumentRef.ПродажаЗапчастей</types>
    </type>
  </attributes>
  <attributes>
    <name>Зарплата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Работник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Месяц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Новые</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>В1С</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВыдачи</name>
    <type>
      <types>EnumRef.ВидВыдачиДенег</types>
    </type>
  </attributes>
  <attributes>
    <name>Org</name>
    <type>
      <types>CatalogRef.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>bank</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>bankDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетОткудаРасход</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Машины</types>
    </type>
  </attributes>
  <attributes>
    <name>МаршрутныйЛист</name>
    <type>
      <types>DocumentRef.МаршрутныйЛист</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоТопливо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийСписаниеДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПоступлениеЗапчастей</types>
      <types>CatalogRef.ПроектыРазработки</types>
      <types>DocumentRef.АктВозврата</types>
      <types>DocumentRef.ПродажаЗапчастей</types>
      <types>CatalogRef.ТМЦВорктрак</types>
      <types>CatalogRef.Инвентарь</types>
      <types>CatalogRef.СкладСнабжение</types>
      <types>DocumentRef.ЗаказНаряд</types>
      <types>DocumentRef.ЗаявкаНаРасход</types>
      <types>DocumentRef.ЛистыУщерба</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.ПроектыРазработки</types>
    </type>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаРасход</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРасход</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кредит</name>
    <type>
      <types>DocumentRef.ПриходОтКредитов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРасхода</name>
    <type>
      <types>EnumRef.ТипРасхода</types>
    </type>
  </attributes>
  <attributes>
    <name>Партия</name>
    <type>
      <types>CatalogRef.Партии</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Продажи</name>
    <attributes>
      <name>Продажа</name>
      <type>
        <types>DocumentRef.ПродажаЗапчастей</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусПродажи</name>
      <type>
        <types>EnumRef.СтатусыПродажи</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДоставки</name>
      <type>
        <types>EnumRef.СтатусОтправки</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧРасходы</name>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест/Тест/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>ФИО</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксированаяЧастьЗарплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аванс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьВПланировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиСогласования</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест/Тест/src/Reports/ПланированиеРасходовНаЗарплату/Forms/ФормаОтчета/Module.bsl
&НаКлиенте
Процедура ПоказатьРезультаты(Команда)
	ТабДокумент = ПечатьСервер();
	ТабДокумент.Показать();
КонецПроцедуры


&НаСервере
Функция ПечатьСервер()

	рез = ПриготовитьДляОтчета();
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб = Истина;
	Макет       =   ПолучитьМакет("Макет");
	обл = Макет.ПолучитьОбласть("шапка");
	обл.Параметры.месяц = Формат(Дата(Год,Месяц,1), "ДФ=""ММММ гггг""");
	ТабДокумент.Вывести(обл);
	обл = Макет.ПолучитьОбласть("строка");
	а = 0;
	ав = 0;
	под = 0;
	подв = 0;
	прем = 0;
	другое = 0;
	всего = 0;
	всегов = 0;
	ост = 0;
	Для Каждого стр из рез Цикл
		обл.Параметры.н = стр.н;
		обл.Параметры.фио = стр.фио;
		обл.Параметры.а = стр.а;
		обл.Параметры.ав = стр.аВыдано;
		обл.Параметры.под = стр.под;
		обл.Параметры.подв = стр.подВыдано;
		обл.Параметры.прем = стр.прем;
		обл.Параметры.другое = стр.другое;
		обл.Параметры.всего = стр.всего;
		обл.Параметры.всегов = стр.всегоВыдано;
		обл.Параметры.ост = стр.ост;
		ТабДокумент.Вывести(обл);
		а = а + стр.а;
		ав = ав + стр.аВыдано;
		под = под + стр.под;
		подв = подв + стр.подВыдано;
		прем = прем + стр.прем;
		другое = другое + стр.другое;
		всего = всего + стр.всего;
		всегов = всегов + стр.всегоВыдано;
		ост = ост + стр.ост;
	КонецЦикла;
	обл = Макет.ПолучитьОбласть("подвал");
	обл.Параметры.а = а;
	обл.Параметры.ав = ав;
	обл.Параметры.под = под;
	обл.Параметры.подв = подв;
	обл.Параметры.прем = прем;
	обл.Параметры.другое = другое;
	обл.Параметры.всего = всего;
	обл.Параметры.всегов = всегов;
	обл.Параметры.ост = ост;
	ТабДокумент.Вывести(обл);
	
	Возврат ТабДокумент;

КонецФункции // ПечатьСервер()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Месяц = Месяц(ТекущаяДата());
	Год = Год(ТекущаяДата());
КонецПроцедуры

&НаСервере
Функция ПриготовитьДляОтчета()
	запрос = Новый Запрос;
	рез = Новый Массив;
	
	запрос.Текст="ВЫБРАТЬ
	             |	Пользователи.Ссылка,
	             |	Пользователи.ВерсияДанных,
	             |	Пользователи.ПометкаУдаления,
	             |	Пользователи.Предопределенный,
	             |	Пользователи.Код,
	             |	Пользователи.Наименование,
	             |	Пользователи.ФИО,
	             |	Пользователи.ФиксированаяЧастьЗарплаты,
	             |	Пользователи.Аванс,
	             |	Пользователи.ПоказыватьВПланировании
	             |ИЗ
	             |	Справочник.Пользователи КАК Пользователи
	             |ГДЕ
	             |	Пользователи.ПоказыватьВПланировании = ИСТИНА";
	Пользователи = запрос.Выполнить().Выгрузить();
	н = 1;
	Для каждого п из Пользователи Цикл
		з2 = Новый запрос;
		з2.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ
		         |	Расходы.Сумма,
		         |	Расходы.ВидВыдачи
		         |ИЗ
		         |	Документ.Расходы КАК Расходы
		         |ГДЕ
		         |	Расходы.Работник = &Работник
		         |	И Расходы.Проведен = ИСТИНА
		         |	И Расходы.Месяц = &Месяц
		         |	И Расходы.Год = &Год";
		з2.УстановитьПараметр("Месяц",Месяц);
		з2.УстановитьПараметр("Год",Год);
		з2.УстановитьПараметр("Работник",п.Ссылка);
		зп = з2.Выполнить().Выгрузить();
		премВыдано = 0;
		авансВыдано = 0;
		подсчетВыдано = 0;
		другое = 0;
		Для Каждого з Из зп Цикл
			Если з.ВидВыдачи = Перечисления.ВидВыдачиДенег.Аванс Тогда
				авансВыдано = авансВыдано + з.Сумма;
			КонецЕсли;
			Если з.ВидВыдачи = Перечисления.ВидВыдачиДенег.Подсчет Тогда
				подсчетВыдано = подсчетВыдано + з.Сумма;
			КонецЕсли;
			Если з.ВидВыдачи = Перечисления.ВидВыдачиДенег.Премия Тогда
				премВыдано = премВыдано + з.Сумма;
			КонецЕсли;
			Если з.ВидВыдачи <> Перечисления.ВидВыдачиДенег.Аванс И 
				з.ВидВыдачи <> Перечисления.ВидВыдачиДенег.Подсчет И 
				з.ВидВыдачи <> Перечисления.ВидВыдачиДенег.Премия Тогда
				другое = другое + з.Сумма;
			КонецЕсли
		КонецЦикла;

		рез1 = Новый Структура;
		рез1.Вставить("н",н);
		рез1.Вставить("фио",п.ФИО);
		рез1.Вставить("а",п.Аванс);
		рез1.Вставить("аВыдано",авансВыдано);
		рез1.Вставить("под",п.ФиксированаяЧастьЗарплаты - п.Аванс);
		рез1.Вставить("подВыдано",подсчетВыдано);
		рез1.Вставить("прем",премВыдано);	
		рез1.Вставить("другое",другое);
		рез1.Вставить("всего",п.ФиксированаяЧастьЗарплаты);
		рез1.Вставить("всегоВыдано",зп.Итог("Сумма")-премВыдано-другое);
		рез1.Вставить("ост",п.ФиксированаяЧастьЗарплаты-подсчетВыдано-авансВыдано);

		рез.Добавить(рез1);
		н=н+1;
	КонецЦикла;
	Возврат рез;
КонецФункции

&НаСервере
Процедура УстановитьМесяцГод()
	ВыдачаДенег.Параметры.УстановитьЗначениеПараметра("Месяц",Месяц);
	ВыдачаДенег.Параметры.УстановитьЗначениеПараметра("Год",Год);
КонецПроцедуры


&НаСервере
Функция ПолучитьМакет(название)
	Возврат  Отчеты.ПланированиеРасходовНаЗарплату.ПолучитьМакет(название);
КонецФункции

&НаКлиенте
Процедура ПоказатьРасходы(Команда)
	// Вставить содержимое обработчика.
	УстановитьМесяцГод();
	Элементы.ВыдачаДенег.Видимость = Истина;
КонецПроцедуры
